package kanctovar;

/**
Можно создать классы на каждый тип канцтовара (с учетом наследования)
У них может быть свойство - стоимость
Добавить класс "сотрудник".
У него может быть свойство "канцтовары" - массив объектов или коллекция (ArrayList например)
Стоимость можно определить если пробежать по всему массиву. 
И вот тут как раз будет выгодно иметь свойство "цена" в классе, 
который является родительским для всех канцтоваров. 
Тогда метод подсчета не будет зависеть от типа товара
 
*/
public class sotrudnik {

	public static void main(String[] args) {
		
	}
}


